In [2]:
import pandas as pd
import csv
import numpy
# encoding='utf8'
Trip_df=pd.read_csv('/content/sample_data/CLIWOC15.csv')
Trip_df
# #how many rows and columns are in each data frame
print('Trip Rows:',(Trip_df.count()))
print('trip columns:', len(Trip_df.columns))

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:3326: DtypeWarning: Columns (3,11,17,18,19,23,24,25,26,28,29,30,33,34,35,38,43,46,49,59,63,73,77,81,82,84,87,98,113,114,116,119,129,131,133,135,137,140) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

Trip Rows: RecID                66685
InstAbbr             65823
InstName             65823
InstPlace            47551
InstLand             66685
                     ...
WarsAndFights        66684
WarsAndFightsMemo        9
Illustrations        66684
TrivialCorrection    66684
OtherRem              6199
Length: 141, dtype: int64
trip columns: 141

In [3]:
Ship_df=pd.read_csv('/content/sample_data/Ships.csv')

#how many rows and columns are in each data frame
print('Ship Rows:',len(Ship_df))
print('Ship columns:', len(Ship_df.columns))
#print(Ship_df.count())

Ship Rows: 1185
Ship columns: 3

In [4]:
# # #Show if there are any duplicate combination of all three attributes in the Ship_df, this can just show the counts of combinations.
# # #find the duplicate rows    
Ship_df[Ship_df.duplicated(subset=['ShipName','ShipType','Nationality'])]

          ShipName         ShipType Nationality
1174     EL CUERVO        PAQUEBOTE     Spanish
1175    Cumberland              NaN     British
1176      Euridice           Fregat       Dutch
1177         Otter            Sloop     British
1178   Shaftesbury              NaN     British
1179  EL RELÁMPAGO        BERGANTÍN     Spanish
1180        Dublin         3rd Rate     British
1181      Squirrel         6th Rate     British
1182      LA PERLA  FRAGATA DE GUER     Spanish
1183          Star       Brig-Sloop     British
1184         Janus         5th Rate     British

In [5]:
columns=['ShipName','ShipType','Nationality']  #I DID DROP NA
df = (Ship_df\
      .groupby(Ship_df.columns.tolist()).apply(len)\
      .rename('group_count')\
      .reset_index()\
      .sort_values(by = ['group_count'], ascending = False))
dups = df[df["group_count"] > 1]
dups

         ShipName         ShipType Nationality  group_count
339         Janus         5th Rate     British            2
488         Otter            Sloop     British            2
373      LA PERLA  FRAGATA DE GUER     Spanish            2
217  EL RELÁMPAGO        BERGANTÍN     Spanish            2
180        Dublin         3rd Rate     British            2
244      Euridice           Fregat       Dutch            2
667      Squirrel         6th Rate     British            2
193     EL CUERVO        PAQUEBOTE     Spanish            2
673          Star       Brig-Sloop     British            2

In [6]:
ShipDistinct_df= Ship_df.drop_duplicates(subset=['ShipName','ShipType','Nationality'])
ShipDistinct_df

            ShipName         ShipType Nationality
0            LA ORBE          FRAGATA     Spanish
1         SAN CARLOS        PAQUEBOTE     Spanish
2     SANTA PERPETUA          FRAGATA     Spanish
3          LA LIEBRE          FRAGATA     Spanish
4        LA ATREVIDA          FRAGATA     Spanish
...              ...              ...         ...
1169       EL AGUILA   Fragata correo     Spanish
1170       EL AGUILA  FRAGATA/ CORREO     Spanish
1171       Amsterdam              NaN       Dutch
1172       Amsterdam       Stoomschip       Dutch
1173        Euryalus         5th Rate     British

[1174 rows x 3 columns]

In [7]:
#record count
print('ShipDistinct_df Rows:',(ShipDistinct_df.count()))
print('ShipDistinct_df columns:', len(ShipDistinct_df.columns))

ShipDistinct_df Rows: ShipName       1174
ShipType        770
Nationality    1174
dtype: int64
ShipDistinct_df columns: 3

In [8]:
##of rows
rows_dropped= len(Ship_df)-ShipDistinct_df.shape[0]
print(rows_dropped)

11

5.	Now let’s focus on the Trip_df.  Trip has some additional ships (ShipName, ShipType, Nationality) that do not currently appear in ShipDistinct_df.  These new dimension rows need to be pulled and added to the dimension table.   Inspect the column names of the Trips_df and provide screenshot of the columns.

In [9]:
pd.set_option('display.max_columns', 25)
#columns=ShipDistinct_df[['ShipName','ShipType','Nationality']]
Trip_df.columns.tolist()

['RecID',
 'InstAbbr',
 'InstName',
 'InstPlace',
 'InstLand',
 'NumberEntry',
 'NameArchiveSet',
 'ArchivePart',
 'Specification',
 'LogbookIdent',
 'LogbookLanguage',
 'EnteredBy',
 'DASnumber',
 'ImageNumber',
 'VoyageFrom',
 'VoyageTo',
 'ShipName',
 'ShipType',
 'Company',
 'OtherShipInformation',
 'Nationality',
 'Name1',
 'Rank1',
 'Name2',
 'Rank2',
 'Name3',
 'Rank3',
 'ZeroMeridian',
 'StartDay',
 'TimeGen',
 'ObsGen',
 'ReferenceCourse',
 'ReferenceWindDirection',
 'DistUnits',
 'DistToLandmarkUnits',
 'DistTravelledUnits',
 'LongitudeUnits',
 'VoyageIni',
 'UnitsOfMeasurement',
 'Calendar',
 'Year',
 'Month',
 'Day',
 'DayOfTheWeek',
 'PartDay',
 'TimeOB',
 'Watch',
 'Glasses',
 'UTC',
 'CMG',
 'ShipSpeed',
 'Distance',
 'drLatDeg',
 'drLatMin',
 'drLatSec',
 'drLatHem',
 'drLongDeg',
 'drLongMin',
 'drLongSec',
 'drLongHem',
 'LatDeg',
 'LatMin',
 'LatSec',
 'LatHem',
 'LongDeg',
 'LongMin',
 'LongSec',
 'LongHem',
 'Lat3',
 'Lon3',
 'LatInd',
 'LonInd',
 'PosCoastal',
 'EncName',
 'EncNat',
 'EncRem',
 'Anchored',
 'AnchorPlace',
 'LMname1',
 'LMdirection1',
 'LMdistance1',
 'LMname2',
 'LMdirection2',
 'LMdistance2',
 'LMname3',
 'LMdirection3',
 'LMdistance3',
 'EstError',
 'ApplError',
 'WindDirection',
 'AllWindDirections',
 'WindForce',
 'WindForceScale',
 'AllWindForces',
 'WindScale',
 'Weather',
 'ShapeClouds',
 'DirClouds',
 'Clearness',
 'PrecipitationDescriptor',
 'CloudFrac',
 'Gusts',
 'Rain',
 'Fog',
 'Snow',
 'Thunder',
 'Hail',
 'SeaIce',
 'Duplicate',
 'Release',
 'SSTReading',
 'SSTReadingUnits',
 'StateSea',
 'CurrentDir',
 'CurrentSpeed',
 'TairReading',
 'AirThermReadingUnits',
 'ProbTair',
 'BaroReading',
 'AirPressureReadingUnits',
 'BarometerType',
 'BarTempReading',
 'BarTempReadingUnits',
 'HumReading',
 'HumidityUnits',
 'HumidityMethod',
 'PumpWater',
 'WaterAtThePumpUnits',
 'LifeOnBoard',
 'LifeOnBoardMemo',
 'Cargo',
 'CargoMemo',
 'ShipAndRig',
 'ShipAndRigMemo',
 'Biology',
 'BiologyMemo',
 'WarsAndFights',
 'WarsAndFightsMemo',
 'Illustrations',
 'TrivialCorrection',
 'OtherRem']

6.	 Our goal is to identify any Ships in Trips_df that is not in ShipDistinct. We can use a LEFT JOIN on these dataframes to determine which values of (ShipName, ShipType, Nationality) are in Trip_df but not in ShipDistinct_df.  

First create a joined data frame called ShipTrips_df by using the merge() function on the Trips_df and the ShipDistinct_df; use a left join on (ShipName, ShipType, Nationality) and set the indicator to True.

In [10]:
ShipsTrips_df = ShipDistinct_df.merge(Trip_df,how='left',on=['ShipName','ShipType','Nationality'], indicator=True)
ShipsTrips_df

,ShipName,ShipType,Nationality,RecID,InstAbbr,InstName,InstPlace,InstLand,NumberEntry,NameArchiveSet,ArchivePart,Specification,...,Cargo,CargoMemo,ShipAndRig,ShipAndRigMemo,Biology,BiologyMemo,WarsAndFights,WarsAndFightsMemo,Illustrations,TrivialCorrection,OtherRem,_merge
0,LA ORBE,FRAGATA,Spanish,108.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,"LA FRAGATA BRETAÑA, DESPUES DE HABER CORRIDO U...",both
1,LA ORBE,FRAGATA,Spanish,114.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,EL CASTOR SE SEPARA DE ELLOS CONSIDERANDOSE A ...,both
2,LA ORBE,FRAGATA,Spanish,115.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,AVISTAN TIERRA QUE CONSIDERAN ERA MANTA O EL C...,both
3,LA ORBE,FRAGATA,Spanish,116.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,PASAN ESTE DIA Y SU NOCHE EN LAS MISMAS CIRCUN...,both
4,LA ORBE,FRAGATA,Spanish,117.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,ESTANDO EN LAS MISMAS CIRCUNSTANCIAS LOS VIGIA...,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
66391,EL AGUILA,Fragata correo,Spanish,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
66392,EL AGUILA,FRAGATA/ CORREO,Spanish,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
66393,Amsterdam,NaN,Dutch,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
66394,Amsterdam,Stoomschip,Dutch,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only
66395,Euryalus,5th Rate,British,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,left_only

7.	Inspect the resulting ShipsTrips_df data frame (use the head() function), specifically scroll all the way to the right and note the _merge column that has been added.  Let’s determine the unique combinations of _merge column by using the value_counts() function.
Show the value_counts() of the _merge column.

In [11]:
ShipsTrips_df.head()

,ShipName,ShipType,Nationality,RecID,InstAbbr,InstName,InstPlace,InstLand,NumberEntry,NameArchiveSet,ArchivePart,Specification,...,Cargo,CargoMemo,ShipAndRig,ShipAndRigMemo,Biology,BiologyMemo,WarsAndFights,WarsAndFightsMemo,Illustrations,TrivialCorrection,OtherRem,_merge
0,LA ORBE,FRAGATA,Spanish,108.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,"LA FRAGATA BRETAÑA, DESPUES DE HABER CORRIDO U...",both
1,LA ORBE,FRAGATA,Spanish,114.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,EL CASTOR SE SEPARA DE ELLOS CONSIDERANDOSE A ...,both
2,LA ORBE,FRAGATA,Spanish,115.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,AVISTAN TIERRA QUE CONSIDERAN ERA MANTA O EL C...,both
3,LA ORBE,FRAGATA,Spanish,116.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,PASAN ESTE DIA Y SU NOCHE EN LAS MISMAS CIRCUN...,both
4,LA ORBE,FRAGATA,Spanish,117.0,MNM,Archivo Museo Naval Madrid,Madrid,Spain,NaN,NaN,NaN,NaN,...,0.0,NaN,0.0,NaN,0.0,NaN,0.0,NaN,0.0,0.0,ESTANDO EN LAS MISMAS CIRCUNSTANCIAS LOS VIGIA...,both

In [12]:
ShipsTrips_df._merge.value_counts()

both          65538
left_only       858
right_only        0
Name: _merge, dtype: int64

8.	Now we can filter out the new records we will need to bring into our Ships from the joined data frame, decide the filter condition based on the results from question 7. 
Hint: Look into query and filter functions to use on the ShipsTrips_df.  The filter function will show the attributes that we want to look at, while the query function will help us filter the results

In [13]:
ShipsTrips_df.filter(items=['ShipName', 'ShipType', 'Nationality', '_merge'])

        ShipName         ShipType Nationality     _merge
0        LA ORBE          FRAGATA     Spanish       both
1        LA ORBE          FRAGATA     Spanish       both
2        LA ORBE          FRAGATA     Spanish       both
3        LA ORBE          FRAGATA     Spanish       both
4        LA ORBE          FRAGATA     Spanish       both
...          ...              ...         ...        ...
66391  EL AGUILA   Fragata correo     Spanish  left_only
66392  EL AGUILA  FRAGATA/ CORREO     Spanish  left_only
66393  Amsterdam              NaN       Dutch  left_only
66394  Amsterdam       Stoomschip       Dutch  left_only
66395   Euryalus         5th Rate     British  left_only

[66396 rows x 4 columns]

Provide the function call for the ShipsTrips_df showing only the columns that we need (ShipName, ShipType, Nationality), as well as the _merge column.  The function call should filter (query) _merge column as outlined in the directions above.

9.	Your rows count should match the count in question 7. How many new records were found?

In [14]:
len(ShipsTrips_df)

66396

10.	Now let’s find the distinct instances of the ShipName, ShipType, and Nationality.  Perform the same operations as outlined in steps 2 through 4 to create a ShipsTrips_Distinct_df  (this new data frame should not have any duplicates)

In [15]:
ShipsTrips_Distinct_df= ShipsTrips_df[['ShipName','ShipType','Nationality']].drop_duplicates()

11.	Show the resulting data frame – list all the data.

In [ ]:
ShipsTrips_Distinct_df

In [16]:
ShipsTrips_Distinct_df.count()

ShipName       1174
ShipType        770
Nationality    1174
dtype: int64

12.	Combine the two distinct data frames (ShipsDistinct_df and  ShipsTrips_Distinct_df ) into DimShip data frame. Hint: Use the pandas append() or the pd.concat() function, look to ignore the existing index as we will create a new surrogate primary key in the next step.

In [17]:
DimShip=ShipsTrips_Distinct_df.append(ShipDistinct_df, ignore_index = True)
DimShip
#DimShip.to_csv('dimship.csv')

            ShipName         ShipType Nationality
0            LA ORBE          FRAGATA     Spanish
1         SAN CARLOS        PAQUEBOTE     Spanish
2     SANTA PERPETUA          FRAGATA     Spanish
3          LA LIEBRE          FRAGATA     Spanish
4        LA ATREVIDA          FRAGATA     Spanish
...              ...              ...         ...
2343       EL AGUILA   Fragata correo     Spanish
2344       EL AGUILA  FRAGATA/ CORREO     Spanish
2345       Amsterdam              NaN       Dutch
2346       Amsterdam       Stoomschip       Dutch
2347        Euryalus         5th Rate     British

[2348 rows x 3 columns]

How many records are in DimShip now?

In [ ]:
len(DimShip)

2348

13.	Now we need to create a surrogate primary key for the DimShip data frame.  Use the reset_index() function to add a column to the DimShip data frame and call the column “Id”, start the index at 1.  Hint: investigate how to add a new column to the existing data frame.

In [18]:
DimShip.index=list(range(1,len(DimShip)+1))
DimShip.index.names = ['ID']
##OR DimShip.index=DimShip.index +1

DimShip.rename(columns={DimShip.columns[0]:'ID'})
display(DimShip)

            ShipName         ShipType Nationality
ID
1            LA ORBE          FRAGATA     Spanish
2         SAN CARLOS        PAQUEBOTE     Spanish
3     SANTA PERPETUA          FRAGATA     Spanish
4          LA LIEBRE          FRAGATA     Spanish
5        LA ATREVIDA          FRAGATA     Spanish
...              ...              ...         ...
2344       EL AGUILA   Fragata correo     Spanish
2345       EL AGUILA  FRAGATA/ CORREO     Spanish
2346       Amsterdam              NaN       Dutch
2347       Amsterdam       Stoomschip       Dutch
2348        Euryalus         5th Rate     British

[2348 rows x 3 columns]

Show the command creating the surrogate key for DimShip and a separate command showing the new index column.  Use display() method.

In [19]:
DimShip.to_csv('DimShip.csv')

**Part3**

Now that we have a DimShip dimension, lets focus on creating a FactTrip dat aframe.  There are many columns in the Trip_df – if you recall fact tables contain measures.  Some of the columns are good candidates for additional dimensions, we are going to keep it simple for now and focus on creating a Fact table.  Select three or four numeric columns from the original Trip_df dataframe which you will use. 
14.	List the three measures columns you will use:
•	Measure 1:
•	Measure 2:
•	Measure 3:

In [20]:
DimShip=pd.read_csv('/content/DimShip.csv')
TripFact = DimShip[['ID','ShipName','ShipType','Nationality']]
TripFact

        ID        ShipName         ShipType Nationality
0        1         LA ORBE          FRAGATA     Spanish
1        2      SAN CARLOS        PAQUEBOTE     Spanish
2        3  SANTA PERPETUA          FRAGATA     Spanish
3        4       LA LIEBRE          FRAGATA     Spanish
4        5     LA ATREVIDA          FRAGATA     Spanish
...    ...             ...              ...         ...
2343  2344       EL AGUILA   Fragata correo     Spanish
2344  2345       EL AGUILA  FRAGATA/ CORREO     Spanish
2345  2346       Amsterdam              NaN       Dutch
2346  2347       Amsterdam       Stoomschip       Dutch
2347  2348        Euryalus         5th Rate     British

[2348 rows x 4 columns]

15.	Create a new dataframe called TripFact that includes the following attributes:
a.	ShipName, ShipType, Nationality – these are our natural key to connect the fact table to the ShipDim
b.	RecID, Year, Month, Day (we will work with dates in a later question)
c.	The Id from the DimShip dataframe – you will need to join to the DimShip dataFrame to get this attribute.  Make sure to call this attribute DimShipId
d.	 Three numeric values which you selected in question 15.

In [21]:
TripFact=TripFact.join(Trip_df[['RecID', 'Year', 'Month', 'Day','DistUnits', 'DistTravelledUnits','UnitsOfMeasurement']])
TripFact

,ID,ShipName,ShipType,Nationality,RecID,Year,Month,Day,DistUnits,DistTravelledUnits,UnitsOfMeasurement
0,1,LA ORBE,FRAGATA,Spanish,108,1800,5.0,2.0,DESCONOCIDO,NaN,NaN
1,2,SAN CARLOS,PAQUEBOTE,Spanish,109,1790,4.0,11.0,DESCONOCIDO,NaN,NaN
2,3,SANTA PERPETUA,FRAGATA,Spanish,110,1790,4.0,12.0,DESCONOCIDO,NaN,NaN
3,4,LA LIEBRE,FRAGATA,Spanish,111,1790,4.0,13.0,DESCONOCIDO,NaN,NaN
4,5,LA ATREVIDA,FRAGATA,Spanish,112,1790,4.0,14.0,DESCONOCIDO,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
2343,2344,EL AGUILA,Fragata correo,Spanish,2344,1776,9.0,6.0,Desconocida,NaN,NaN
2344,2345,EL AGUILA,FRAGATA/ CORREO,Spanish,2345,1776,9.0,6.0,Desconocida,NaN,NaN
2345,2346,Amsterdam,NaN,Dutch,2346,1776,9.0,7.0,Desconocida,NaN,NaN
2346,2347,Amsterdam,Stoomschip,Dutch,2347,1776,9.0,7.0,Desconocida,NaN,NaN
2347,2348,Euryalus,5th Rate,British,2348,1776,9.0,7.0,Desconocida,NaN,NaN

In [ ]:
TripFact.count()

ID                    2348
ShipName              2348
ShipType              1540
Nationality           2348
RecID                 2348
Year                  2348
Month                 2348
Day                   2348
DistUnits             2348
DistTravelledUnits       0
UnitsOfMeasurement       2
dtype: int64

In [ ]:
Trip_df.count()

RecID                14980
InstAbbr             14699
InstName             14699
InstPlace            13621
InstLand             14980
                     ...
WarsAndFights        14979
WarsAndFightsMemo        0
Illustrations        14979
TrivialCorrection    14979
OtherRem              1172
Length: 141, dtype: int64

16.	Add a surrogate key to the FactTrip data frame like we did in step 13 for the DimShip data frame.

In [22]:
TripFact.index=TripFact.index +1

In [23]:
TripFact.reset_index()

,index,ID,ShipName,ShipType,Nationality,RecID,Year,Month,Day,DistUnits,DistTravelledUnits,UnitsOfMeasurement
0,1,1,LA ORBE,FRAGATA,Spanish,108,1800,5.0,2.0,DESCONOCIDO,NaN,NaN
1,2,2,SAN CARLOS,PAQUEBOTE,Spanish,109,1790,4.0,11.0,DESCONOCIDO,NaN,NaN
2,3,3,SANTA PERPETUA,FRAGATA,Spanish,110,1790,4.0,12.0,DESCONOCIDO,NaN,NaN
3,4,4,LA LIEBRE,FRAGATA,Spanish,111,1790,4.0,13.0,DESCONOCIDO,NaN,NaN
4,5,5,LA ATREVIDA,FRAGATA,Spanish,112,1790,4.0,14.0,DESCONOCIDO,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
2343,2344,2344,EL AGUILA,Fragata correo,Spanish,2344,1776,9.0,6.0,Desconocida,NaN,NaN
2344,2345,2345,EL AGUILA,FRAGATA/ CORREO,Spanish,2345,1776,9.0,6.0,Desconocida,NaN,NaN
2345,2346,2346,Amsterdam,NaN,Dutch,2346,1776,9.0,7.0,Desconocida,NaN,NaN
2346,2347,2347,Amsterdam,Stoomschip,Dutch,2347,1776,9.0,7.0,Desconocida,NaN,NaN
2347,2348,2348,Euryalus,5th Rate,British,2348,1776,9.0,7.0,Desconocida,NaN,NaN

17.	Provide the command and results of creating the surrogate key for FactTrip and a second command and results showing the new index column including several rows of the FactTrip data frame.  Use display() method.

In [ ]:
display(TripFact)

,ID,ShipName,ShipType,Nationality,RecID,Year,Month,Day,DistUnits,DistTravelledUnits,UnitsOfMeasurement
1,1,LA ORBE,FRAGATA,Spanish,108,1800,5,2,DESCONOCIDO,NaN,NaN
2,2,SAN CARLOS,PAQUEBOTE,Spanish,109,1790,4,11,DESCONOCIDO,NaN,NaN
3,3,SANTA PERPETUA,FRAGATA,Spanish,110,1790,4,12,DESCONOCIDO,NaN,NaN
4,4,LA LIEBRE,FRAGATA,Spanish,111,1790,4,13,DESCONOCIDO,NaN,NaN
5,5,LA ATREVIDA,FRAGATA,Spanish,112,1790,4,14,DESCONOCIDO,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
2344,2344,EL AGUILA,Fragata correo,Spanish,2344,1776,9,6,Desconocida,NaN,NaN
2345,2345,EL AGUILA,FRAGATA/ CORREO,Spanish,2345,1776,9,6,Desconocida,NaN,NaN
2346,2346,Amsterdam,NaN,Dutch,2346,1776,9,7,Desconocida,NaN,NaN
2347,2347,Amsterdam,Stoomschip,Dutch,2347,1776,9,7,Desconocida,NaN,NaN
2348,2348,Euryalus,5th Rate,British,2348,1776,9,7,Desconocida,NaN,NaN

**Part 4 – Transformation: Dates**

> There are a few columns in the FactTrip data frame that, together, indicate a specific date: Year, Month, Day.  We will use the next step to transform those columns into a date column. 
18.	Add two new columns to the data frame and populate one with a string for the date and the second with the date calculated from the string.  Hint, look into date formatting and string conversion as well as the to_datetime() function and pay attention to how to handle errors (errors='coerce') and format.

In [24]:
import datetime
TripFact['Date_String'] = pd.to_datetime(TripFact[['Month','Day','Year']])
TripFact.Date_String = pd.to_datetime(TripFact.Date_String).dt.strftime('%d-%b-%Y')

In [ ]:
TripFact

,ID,ShipName,ShipType,Nationality,RecID,Year,Month,Day,DistUnits,DistTravelledUnits,UnitsOfMeasurement,Date_String
1,1,LA ORBE,FRAGATA,Spanish,108,1800,5,2,DESCONOCIDO,NaN,NaN,02-May-1800
2,2,SAN CARLOS,PAQUEBOTE,Spanish,109,1790,4,11,DESCONOCIDO,NaN,NaN,11-Apr-1790
3,3,SANTA PERPETUA,FRAGATA,Spanish,110,1790,4,12,DESCONOCIDO,NaN,NaN,12-Apr-1790
4,4,LA LIEBRE,FRAGATA,Spanish,111,1790,4,13,DESCONOCIDO,NaN,NaN,13-Apr-1790
5,5,LA ATREVIDA,FRAGATA,Spanish,112,1790,4,14,DESCONOCIDO,NaN,NaN,14-Apr-1790
...,...,...,...,...,...,...,...,...,...,...,...,...
2344,2344,EL AGUILA,Fragata correo,Spanish,2344,1776,9,6,Desconocida,NaN,NaN,06-Sep-1776
2345,2345,EL AGUILA,FRAGATA/ CORREO,Spanish,2345,1776,9,6,Desconocida,NaN,NaN,06-Sep-1776
2346,2346,Amsterdam,NaN,Dutch,2346,1776,9,7,Desconocida,NaN,NaN,07-Sep-1776
2347,2347,Amsterdam,Stoomschip,Dutch,2347,1776,9,7,Desconocida,NaN,NaN,07-Sep-1776
2348,2348,Euryalus,5th Rate,British,2348,1776,9,7,Desconocida,NaN,NaN,07-Sep-1776

In [ ]:
display(TripFact)

,ID,ShipName,ShipType,Nationality,RecID,Year,Month,Day,DistUnits,DistTravelledUnits,UnitsOfMeasurement,Date_String
1,1,LA ORBE,FRAGATA,Spanish,108,1800,5,2,DESCONOCIDO,NaN,NaN,02-May-1800
2,2,SAN CARLOS,PAQUEBOTE,Spanish,109,1790,4,11,DESCONOCIDO,NaN,NaN,11-Apr-1790
3,3,SANTA PERPETUA,FRAGATA,Spanish,110,1790,4,12,DESCONOCIDO,NaN,NaN,12-Apr-1790
4,4,LA LIEBRE,FRAGATA,Spanish,111,1790,4,13,DESCONOCIDO,NaN,NaN,13-Apr-1790
5,5,LA ATREVIDA,FRAGATA,Spanish,112,1790,4,14,DESCONOCIDO,NaN,NaN,14-Apr-1790
...,...,...,...,...,...,...,...,...,...,...,...,...
2344,2344,EL AGUILA,Fragata correo,Spanish,2344,1776,9,6,Desconocida,NaN,NaN,06-Sep-1776
2345,2345,EL AGUILA,FRAGATA/ CORREO,Spanish,2345,1776,9,6,Desconocida,NaN,NaN,06-Sep-1776
2346,2346,Amsterdam,NaN,Dutch,2346,1776,9,7,Desconocida,NaN,NaN,07-Sep-1776
2347,2347,Amsterdam,Stoomschip,Dutch,2347,1776,9,7,Desconocida,NaN,NaN,07-Sep-1776
2348,2348,Euryalus,5th Rate,British,2348,1776,9,7,Desconocida,NaN,NaN,07-Sep-1776

19.	Take a screen shot showing the first 10-20 rows of the updated FactTrip data frame.

**Part 5 – Load the data frames into the database tables**

> Create a new database in your system and create a table called Dim_Ship and load it with the DimShip data frame.  The Dim_Ship table should have all the attributes from the DimShip including the primary key.  You can choose to use SQL or Python to create the Dim_Ship table.  Using Python, populate the new Dim_Ship table. 

20.	Take a screen shot of your command to create the Dim_Ship table in your database

In [29]:
pip install pyodbc

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyodbc
  Downloading pyodbc-4.0.34-cp37-cp37m-manylinux_2_24_x86_64.whl (472 kB)
     |████████████████████████████████| 472 kB 18.5 MB/s
Installing collected packages: pyodbc
Successfully installed pyodbc-4.0.34

In [28]:
pip install sqlalchemy

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.42)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.13.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.3.post0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.10.0)

In [ ]:
%load_ext sql
%sql mssql+pyodbc://LAPTOP-BLFNP60T\maka:Moscow1993!@sql

(pyodbc.InterfaceError) ('IM002', '[IM002] [unixODBC][Driver Manager]Data source name not found, and no default driver specified (0) (SQLDriverConnect)')
(Background on this error at: https://sqlalche.me/e/14/rvf5)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [45]:
!pip install teradata

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting teradata
  Downloading teradata-15.10.0.21.tar.gz (50 kB)
     |████████████████████████████████| 50 kB 6.0 MB/s
Building wheels for collected packages: teradata
  Building wheel for teradata (setup.py) ... done
  Created wheel for teradata: filename=teradata-15.10.0.21-py3-none-any.whl size=41901 sha256=f0e16e9f5edac2163132ed05fda7a87ce49556b00632ba7591a9db31e58b612f
  Stored in directory: /root/.cache/pip/wheels/aa/9d/e6/4473e4e52441013dd7416d7f0fe2ef161fa36dec93664c2e18
Successfully built teradata
Installing collected packages: teradata
Successfully installed teradata-15.10.0.21

In [47]:
import pyodbc
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/drive/MyDrive/my_db/my_db.db")

In [48]:
#conx=pyodbc.connect('Driver={ODBC Driver 18 for SQL Server};SERVER=LAPTOP-BLFNP60T;DATABASE=Homework;Trusted_Connection=yes;')

conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=LAPTOP-BLFNP60T;'
                      'Database=Homework;'
                      'Trusted_Connection=yes')
cursor = conn.cursor()

Error: ignored

In [ ]:
# conn = pytds.connect('server', 'database', 'user', 'password') as conn:
# SQL_Query = pd.read_sql_query('''SELECT * FROM ApplicationDB.jkk.dataSQLRaw''', conn)
# data = pd.DataFrame(SQL_Query)


conn = pyodbc.connect('Driver={ODBC Driver 17 for SQL Server}','Server=LAPTOP-BLFNP60T\maka','Database=Homework','Trusted_Connection=yes')

TypeError: ignored

21.	Show your command of loading the DimShip into the database using Python.

22.	Display the loaded data from the Dim_Ship table in your Database using SQL